/* Задание за урока:

1) Създайте променливА numberofFillms и в нея поставете отговор от ползвателя на въпроса:
'Колко филма сте гледали?'

2) Създайте обект personalMovieDB и в него поставете слените свойства:
    - count - дава отговор на първия въпрос
    - movies - в това свойство поставете празен обект
    - actors - в това свойство поставете празен обект
    - genres - в това свойство поставете празен масив 
    - privat - в това свойство поставете булевото(логическо) значение false

3) Задайте на ползвателя два въпроса:
    - 'Един от последно гледаните филми'
    - 'На колко го оценявате?'
Отговорите да се направят в отделни променливи
Зпишете отговотите в обект movies във формат:
    movies: {
        'logan': '8.1'
    }
movie.
Проверете че всичко работи без грешки в конзолата.*/


const numberOfFilms = +prompt('Колко филма сте гледали?', '');  // Променлива

const personalMovieDB = { // Най-важното е този обект
    count: numberOfFilms,  // Това свойство дава отговор на "Колко филма сте гледали"
    movies: {},           // В това свойство е поместен пуст обект
    actors: {},           // В това свойство е поместен пуст обек
    genres: [],           // В това свойство е поместен пуст масив
    privat: false // В това свойство е поместено булево(логическото) значение false
};

const a = prompt('Един от последно гледаните филми', ''),// Техническа променлива, използва се само веднъж
      b = prompt('На калко го оценявате?', ''),          // Техническа променлива, използва се само веднъж
      c = prompt('Един от последно гледаните филми', ''),// Техническа променлива, използва се само веднъж
      d = prompt('На колко го оценявате?');              // Техническа променлива, използва се само веднъж

personalMovieDB.movies[a] = b;
personalMovieDB.movies[c] = d;
// personalMovieDB.movies.a = b; - неправилен запис - ако въведената информация е на кирилица не са пазпознава
// personalMovieDB.movies.c = d;

console.log(personalMovieDB);